<a href="https://colab.research.google.com/github/JakeOh/202103_itw_pyda_wkd/blob/main/da11_movielens.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# 데이터 프레임 merge

In [4]:
emp = pd.DataFrame({'empno': np.arange(1, 6),
                    'empname': ['a', 'b', 'c', 'd', 'e'],
                    'deptno': [10, 20, 30, 10, 50]})
emp

   empno empname  deptno
0      1       a      10
1      2       b      20
2      3       c      30
3      4       d      10
4      5       e      50

In [3]:
dept = pd.DataFrame({'deptno': np.arange(10, 50, 10),
                     'deptname': ['HR', 'IT', 'Sales', 'Account']})
dept

   deptno deptname
0      10       HR
1      20       IT
2      30    Sales
3      40  Account

In [5]:
pd.merge(left=emp, right=dept)
# how 파라미터: inner, left, right, outer. 기본값은 inner.

   empno empname  deptno deptname
0      1       a      10       HR
1      4       d      10       HR
2      2       b      20       IT
3      3       c      30    Sales

In [6]:
pd.merge(left=emp, right=dept, how='left')  # left (outer) join

   empno empname  deptno deptname
0      1       a      10       HR
1      2       b      20       IT
2      3       c      30    Sales
3      4       d      10       HR
4      5       e      50      NaN

In [7]:
pd.merge(left=emp, right=dept, how='right')  # right (outer) join

   empno empname  deptno deptname
0    1.0       a      10       HR
1    4.0       d      10       HR
2    2.0       b      20       IT
3    3.0       c      30    Sales
4    NaN     NaN      40  Account

In [8]:
pd.merge(left=emp, right=dept, how='outer')  # full (outer) join

   empno empname  deptno deptname
0    1.0       a      10       HR
1    4.0       d      10       HR
2    2.0       b      20       IT
3    3.0       c      30    Sales
4    5.0       e      50      NaN
5    NaN     NaN      40  Account

# Movielens 데이터 셋

In [9]:
movies_file = 'https://github.com/wesm/pydata-book/raw/2nd-edition/datasets/movielens/movies.dat'
ratings_file = 'https://github.com/wesm/pydata-book/raw/2nd-edition/datasets/movielens/ratings.dat'
users_file = 'https://github.com/wesm/pydata-book/raw/2nd-edition/datasets/movielens/users.dat'

In [10]:
movies_col = ['movie_id', 'title', 'genres']
ratings_col = ['user_id', 'movie_id', 'rating', 'timestamp']
users_col = ['user_id', 'gender', 'age', 'occupation', 'zipcode']

In [14]:
movies = pd.read_csv(movies_file,        # 파일 경로(URL)
                     engine='python',    # separator 관련 warning을 제거
                     sep='::',           # 값 구분자(value separator)가 쉼표가 아니라 '::'임을 설정
                     header=None,        # 파일에 헤더가 없음. 첫번째 라인부터 데이터.
                     names=movies_col,   # 컬럼 이름 설정
                     encoding='cp1252')  # 파일 인코딩 설정
# cp1252: 영문 MS-Windows에서 저장된 텍스트 파일
# cp949: 한글 MS-Windows에서 저장된 텍스트 파일
movies.head()

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [16]:
ratings = pd.read_csv(ratings_file,
                      sep='::',
                      engine='python',
                      header=None,
                      names=ratings_col)
ratings.head()

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [17]:
users = pd.read_csv(users_file,
                    sep='::',
                    engine='python',
                    header=None,
                    names=users_col)
users.head()

   user_id gender  age  occupation zipcode
0        1      F    1          10   48067
1        2      M   56          16   70072
2        3      M   25          15   55117
3        4      M   45           7   02460
4        5      M   25          20   55455

# 데이터 셋 merge

In [18]:
# ratings와 movies를 merge
ratings_movies = pd.merge(left=ratings, right=movies)
ratings_movies

         user_id  ...                genres
0              1  ...                 Drama
1              2  ...                 Drama
2             12  ...                 Drama
3             15  ...                 Drama
4             17  ...                 Drama
...          ...  ...                   ...
1000204     5949  ...           Documentary
1000205     5675  ...                 Drama
1000206     5780  ...                 Drama
1000207     5851  ...  Comedy|Drama|Western
1000208     5938  ...           Documentary

[1000209 rows x 6 columns]

In [19]:
# ratings_movies와 users를 merge
df = pd.merge(left=ratings_movies, right=users)
df

         user_id  movie_id  rating  timestamp  ... gender age occupation  zipcode
0              1      1193       5  978300760  ...      F   1         10    48067
1              1       661       3  978302109  ...      F   1         10    48067
2              1       914       3  978301968  ...      F   1         10    48067
3              1      3408       4  978300275  ...      F   1         10    48067
4              1      2355       5  978824291  ...      F   1         10    48067
...          ...       ...     ...        ...  ...    ...  ..        ...      ...
1000204     4211      3791       2  965319075  ...      M  45          5    77662
1000205     4211      3806       3  965319138  ...      M  45          5    77662
1000206     4211      3840       4  965319197  ...      M  45          5    77662
1000207     4211      3766       2  965319138  ...      M  45          5    77662
1000208     4211      3834       2  965318885  ...      M  45          5    77662

[1000209 rows x 10 columns]

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000209 entries, 0 to 1000208
Data columns (total 10 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   user_id     1000209 non-null  int64
 1   movie_id    1000209 non-null  int64
 2   rating      1000209 non-null  int64
 3   timestamp   1000209 non-null  int64
 4   title       1000209 non-null  object
 5   genres      1000209 non-null  object
 6   gender      1000209 non-null  object
 7   age         1000209 non-null  int64
 8   occupation  1000209 non-null  int64
 9   zipcode     1000209 non-null  object
dtypes: int64(6), object(4)
memory usage: 83.9+ MB

# 성별 영화 선호도 차이

In [21]:
# 제목(title)별, 성(gender)별 평점(rating)의 평균
df.groupby(['title', 'gender'])['rating'].mean()

title                                       gender
$1,000,000 Duck (1971)                      F         3.375000
                                            M         2.761905
'Night Mother (1986)                        F         3.388889
                                            M         3.352941
'Til There Was You (1997)                   F         2.675676
                                                        ...
Zero Kelvin (Kjærlighetens kjøtere) (1995)  M         3.500000
Zeus and Roxanne (1997)                     F         2.777778
                                            M         2.357143
eXistenZ (1999)                             F         3.098592
                                            M         3.289086
Name: rating, Length: 7152, dtype: float64

In [22]:
df.pivot_table(values='rating', index='title', columns='gender')

gender                                             F         M
title
$1,000,000 Duck (1971)                      3.375000  2.761905
'Night Mother (1986)                        3.388889  3.352941
'Til There Was You (1997)                   2.675676  2.733333
'burbs, The (1989)                          2.793478  2.962085
...And Justice for All (1979)               3.828571  3.689024
...                                              ...       ...
Zed & Two Noughts, A (1985)                 3.500000  3.380952
Zero Effect (1998)                          3.864407  3.723140
Zero Kelvin (Kjærlighetens kjøtere) (1995)       NaN  3.500000
Zeus and Roxanne (1997)                     2.777778  2.357143
eXistenZ (1999)                             3.098592  3.289086

[3706 rows x 2 columns]